meeting/agenda/2023/10-10.org
:PROPERTIES:
:ID:       E626CB14-8F34-4865-B7EA-F8C348D9AED3
:END:
#+title: QT4 CG Meeting 049 Agenda 2023-10-10
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (17:00CEST, 11:00EDT, 08:00PDT).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

This meeting will focus on XSLT-related issues and pull requests

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2023/10-03.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for
10 October,
the following meeting is scheduled for
17 October.

Any regrets for the following meeting?

** Review of open action items [1/12]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [X] QT4CG-029-07: NW to open the next discussion of #397 with a demo from DN
  + See PR [[https://qt4cg.org/dashboard/#pr-449][#449]]. Discussion planned for meeting 049, 10 October 2023.
+ [ ] QT4CG-045-02: RD to address comments on HTML namespaces in another PR
+ [ ] QT4CG-046-01: MK to continue the work on #129 for the other specs (we accepted #703)
+ [ ] QT4CG-046-02: RD to draft the specification changes to allow record(*)
+ [ ] QT4CG-046-03: MK to roll back the changes related to default namespaces for elments and types (issue #372)
+ [ ] QT4CG-046-04: CG to flesh out changes related to annotations in other parts of the specs
+ [ ] QT4CG-046-05: NW to updated parse-uri to use decode-from-uri (issue #566)
+ [ ] QT4CG-047-01: MK to make a PR that renames break-when to split-when
+ [ ] QT4CG-048-01: MK - to identify what happens with the mode default rule behaviours. 
+ [ ] QT4CG-048-02: MK to clean up the proposal for adding @as to xsl:sequence and elsewhere
+ [ ] QT4CG-048-03: MK 5.4. - the section on type patterns - replace 3rd paragraph - belongs with predicate patterns. Fix cut-and-paste issues.
+ [ ] QT4CG-048-04: MK to use xs: prefix

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

*** Blocked 
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-635][#635]]: 451: Schema compatibility
+ PR [[https://qt4cg.org/dashboard/#pr-538][#538]]: 480: Attempt to allow xs:string to be 'promoted to' xs:anyURI
+ PR [[https://qt4cg.org/dashboard/#pr-529][#529]]: 528: revision of json(), and renaming to xdm-to-json()
+ PR [[https://qt4cg.org/dashboard/#pr-412][#412]]: 409, QT4CG-027-01: xsl:next-match

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-732][#732]]: 731 Capturing accumulators: Add error conditions, revise streaming rules
+ PR [[https://qt4cg.org/dashboard/#pr-728][#728]]: 52 Allow record(*)
+ PR [[https://qt4cg.org/dashboard/#pr-727][#727]]: 725 Add clarification note for load-xquery-module
+ PR [[https://qt4cg.org/dashboard/#pr-715][#715]]: 372 Rollback the default namespace changes
+ PR [[https://qt4cg.org/dashboard/#pr-650][#650]]: 649: fix an xsl:fallback problem

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be [[https://github.com/qt4cg/qtspecs/labels/Propose%20Closing%20with%20No%20Action][closed without action]].
If you think discussion is necessary, please say so.

None this week.

*** XSLT focused
:PROPERTIES:
:CUSTOM_ID: xslt-focused
:END:

The following PRs appear to be candidates for a future XSLT-focussed
meeting.

+ PR [[https://qt4cg.org/dashboard/#pr-470][#470]]: 369 add fixed-prefixes attribute in XSLT

These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/169][#169]]: Handling of duplicate keys in xsl:map Enhancement
+ Issue [[https://github.com/qt4cg/qtspecs/issues/168][#168]]: XSLT Extension Instructions invoking Named Templates

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-737][#737]]: 295 Boost the capability of recursive record types
+ PR [[https://qt4cg.org/dashboard/#pr-736][#736]]: 730: Clarify (and correct) rules for maps as instances of function types
+ PR [[https://qt4cg.org/dashboard/#pr-734][#734]]: 517: fn:chain
+ PR [[https://qt4cg.org/dashboard/#pr-719][#719]]: 413: Spec for CSV-related functions
+ PR [[https://qt4cg.org/dashboard/#pr-691][#691]]: 688 Semantics of local union types, enumeration types, etc
+ PR [[https://qt4cg.org/dashboard/#pr-659][#659]]: 647: schema location hints

*** Requires confirmation
:PROPERTIES:
:CUSTOM_ID: requires-confirmation
:END:

These issues identify changes that have been made to the specifications but
which have not been established by the community group as the status quo.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/571][#571]]: XSLT: xsl:for-each-group/@break-when
  + Resolved in [[https://qt4cg.org/meeting/minutes/2023/09-26.html#iss-571][meeting 047]]
+ Issue [[https://github.com/qt4cg/qtspecs/issues/372][#372]]: Separate default namespace for elements from the default namespace for types
  + Resolved in [[https://qt4cg.org/meeting/minutes/2023/09-19.html#issue-372][meeting 046]], abandon this change
+ Issue [[https://github.com/qt4cg/qtspecs/issues/283][#283]]: Enumeration types
  + TBD
+ Issue [[https://github.com/qt4cg/qtspecs/issues/233][#233]]: Declare the result type of a mode, via @as
  + Resolved in [[https://qt4cg.org/meeting/minutes/2023/10-03.html#h-2476E3A4-7AB9-474C-8122-04FA7CDC9551][meeting 048]]
+ Issue [[https://github.com/qt4cg/qtspecs/issues/172][#172]]: Record Tests
  + Resolved in [[https://qt4cg.org/meeting/minutes/2023/10-03.html#h-2A975F7E-9A4C-469B-9102-16E450DC8B88][meeting 048]]

*** Proposed for V4.0
:PROPERTIES:
:CUSTOM_ID: proposed-40
:END:

The following issues are labled “proposed for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/716][#716]]: Generators in XPath
+ Issue [[https://github.com/qt4cg/qtspecs/issues/479][#479]]: fn:deep-equal: Input order
+ Issue [[https://github.com/qt4cg/qtspecs/issues/340][#340]]: fn:format-number: Specifying decimal format
+ Issue [[https://github.com/qt4cg/qtspecs/issues/260][#260]]: array:index-of
+ Issue [[https://github.com/qt4cg/qtspecs/issues/238][#238]]: Support Invisible XML
+ Issue [[https://github.com/qt4cg/qtspecs/issues/130][#130]]: New super/union type xs:binary?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/129][#129]]: Context item → Context value?
  + Resolved in [[http://localhost:8132/meeting/minutes/2023/09-12.html#h-D8A3B62B-C816-4F24-A3F5-26A39109E0FC][meeting 045]]

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** Issue #397: Type names
:PROPERTIES:
:CUSTOM_ID: h-1300B775-EF87-43DF-AAAF-F165C62DA36B
:END:

See [[https://github.com/qt4cg/qtspecs/issues/397][#397]]

We’ll begin this week with a demo by DN and a discussion of this issue.

** Issue #283: Enumeration types
:PROPERTIES:
:CUSTOM_ID: h-0612CA13-7474-4617-8818-6AB4F722679E
:END:

See [[https://github.com/qt4cg/qtspecs/issues/283][#283]]

This is the last issue marked as “requires confirmation” that has not
been resolved.

** PR 659: 647: schema location hints
:PROPERTIES:
:CUSTOM_ID: h-D108B9F3-2CD0-40B5-907D-06AF63530EA5
:END:

Just to take the substantive PRs in “the other” order this week…

See PR [[https://qt4cg.org/dashboard/#pr-659][#659]] 

** PR #691: 688 Semantics of local union types, enumeration types, etc
:PROPERTIES:
:CUSTOM_ID: h-7AD4697B-8AB1-4407-9FF7-1FC483115FDC
:END:

See PR [[https://qt4cg.org/dashboard/#pr-691][#691]]

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
