meeting/agenda/2023/10-10.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 049 Agenda 2023-10-10</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 049 Agenda 2023-10-10</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (17:00CEST, 11:00EDT, 08:00PDT).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>

<p>
This meeting will focus on XSLT-related issues and pull requests
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2023/10-03.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for
10 October,
the following meeting is scheduled for
17 October.
</p>

<p>
Any regrets for the following meeting?
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/12]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> QT4CG-029-07: NW to open the next discussion of #397 with a demo from DN
<ul class="org-ul">
<li>See PR <a href="https://qt4cg.org/dashboard/#pr-449">#449</a>. Discussion planned for meeting 049, 10 October 2023.</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-045-02: RD to address comments on HTML namespaces in another PR</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-046-01: MK to continue the work on #129 for the other specs (we accepted #703)</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-046-02: RD to draft the specification changes to allow record(*)</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-046-03: MK to roll back the changes related to default namespaces for elments and types (issue #372)</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-046-04: CG to flesh out changes related to annotations in other parts of the specs</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-046-05: NW to updated parse-uri to use decode-from-uri (issue #566)</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-047-01: MK to make a PR that renames break-when to split-when</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-048-01: MK - to identify what happens with the mode default rule behaviours.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-048-02: MK to clean up the proposal for adding @as to xsl:sequence and elsewhere</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-048-03: MK 5.4. - the section on type patterns - replace 3rd paragraph - belongs with predicate patterns. Fix cut-and-paste issues.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-048-04: MK to use xs: prefix</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-635">#635</a>: 451: Schema compatibility</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-538">#538</a>: 480: Attempt to allow xs:string to be 'promoted to' xs:anyURI</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-529">#529</a>: 528: revision of json(), and renaming to xdm-to-json()</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-412">#412</a>: 409, QT4CG-027-01: xsl:next-match</li>
</ul>
</div>
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-732">#732</a>: 731 Capturing accumulators: Add error conditions, revise streaming rules</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-728">#728</a>: 52 Allow record(*)</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-727">#727</a>: 725 Add clarification note for load-xquery-module</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-715">#715</a>: 372 Rollback the default namespace changes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-650">#650</a>: 649: fix an xsl:fallback problem</li>
</ul>
</div>
</div>

<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be <a href="https://github.com/qt4cg/qtspecs/labels/Propose%20Closing%20with%20No%20Action">closed without action</a>.
If you think discussion is necessary, please say so.
</p>

<p>
None this week.
</p>
</div>
</div>

<div id="outline-container-xslt-focused" class="outline-4">
<h4 id="xslt-focused"><span class="section-number-4">1.6.4.</span> XSLT focused</h4>
<div class="outline-text-4" id="text-xslt-focused">
<p>
The following PRs appear to be candidates for a future XSLT-focussed
meeting.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-470">#470</a>: 369 add fixed-prefixes attribute in XSLT</li>
</ul>

<p>
These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/169">#169</a>: Handling of duplicate keys in xsl:map Enhancement</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/168">#168</a>: XSLT Extension Instructions invoking Named Templates</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.5.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-737">#737</a>: 295 Boost the capability of recursive record types</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-736">#736</a>: 730: Clarify (and correct) rules for maps as instances of function types</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-734">#734</a>: 517: fn:chain</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-719">#719</a>: 413: Spec for CSV-related functions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-691">#691</a>: 688 Semantics of local union types, enumeration types, etc</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-659">#659</a>: 647: schema location hints</li>
</ul>
</div>
</div>

<div id="outline-container-requires-confirmation" class="outline-4">
<h4 id="requires-confirmation"><span class="section-number-4">1.6.6.</span> Requires confirmation</h4>
<div class="outline-text-4" id="text-requires-confirmation">
<p>
These issues identify changes that have been made to the specifications but
which have not been established by the community group as the status quo.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/571">#571</a>: XSLT: xsl:for-each-group/@break-when
<ul class="org-ul">
<li>Resolved in <a href="https://qt4cg.org/meeting/minutes/2023/09-26.html#iss-571">meeting 047</a></li>
</ul></li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/372">#372</a>: Separate default namespace for elements from the default namespace for types
<ul class="org-ul">
<li>Resolved in <a href="https://qt4cg.org/meeting/minutes/2023/09-19.html#issue-372">meeting 046</a>, abandon this change</li>
</ul></li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/283">#283</a>: Enumeration types
<ul class="org-ul">
<li>TBD</li>
</ul></li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/233">#233</a>: Declare the result type of a mode, via @as
<ul class="org-ul">
<li>Resolved in <a href="https://qt4cg.org/meeting/minutes/2023/10-03.html#h-2476E3A4-7AB9-474C-8122-04FA7CDC9551">meeting 048</a></li>
</ul></li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/172">#172</a>: Record Tests
<ul class="org-ul">
<li>Resolved in <a href="https://qt4cg.org/meeting/minutes/2023/10-03.html#h-2A975F7E-9A4C-469B-9102-16E450DC8B88">meeting 048</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-proposed-40" class="outline-4">
<h4 id="proposed-40"><span class="section-number-4">1.6.7.</span> Proposed for V4.0</h4>
<div class="outline-text-4" id="text-proposed-40">
<p>
The following issues are labled “proposed for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/716">#716</a>: Generators in XPath</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/479">#479</a>: fn:deep-equal: Input order</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/340">#340</a>: fn:format-number: Specifying decimal format</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/260">#260</a>: array:index-of</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/238">#238</a>: Support Invisible XML</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/130">#130</a>: New super/union type xs:binary?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/129">#129</a>: Context item → Context value?
<ul class="org-ul">
<li>Resolved in <a href="http://localhost:8132/meeting/minutes/2023/09-12.html#h-D8A3B62B-C816-4F24-A3F5-26A39109E0FC">meeting 045</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-h-1300B775-EF87-43DF-AAAF-F165C62DA36B" class="outline-3">
<h3 id="h-1300B775-EF87-43DF-AAAF-F165C62DA36B"><span class="section-number-3">2.1.</span> Issue #397: Type names</h3>
<div class="outline-text-3" id="text-h-1300B775-EF87-43DF-AAAF-F165C62DA36B">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/397">#397</a>
</p>

<p>
We’ll begin this week with a demo by DN and a discussion of this issue.
</p>
</div>
</div>

<div id="outline-container-h-0612CA13-7474-4617-8818-6AB4F722679E" class="outline-3">
<h3 id="h-0612CA13-7474-4617-8818-6AB4F722679E"><span class="section-number-3">2.2.</span> Issue #283: Enumeration types</h3>
<div class="outline-text-3" id="text-h-0612CA13-7474-4617-8818-6AB4F722679E">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/283">#283</a>
</p>

<p>
This is the last issue marked as “requires confirmation” that has not
been resolved.
</p>
</div>
</div>

<div id="outline-container-h-D108B9F3-2CD0-40B5-907D-06AF63530EA5" class="outline-3">
<h3 id="h-D108B9F3-2CD0-40B5-907D-06AF63530EA5"><span class="section-number-3">2.3.</span> PR 659: 647: schema location hints</h3>
<div class="outline-text-3" id="text-h-D108B9F3-2CD0-40B5-907D-06AF63530EA5">
<p>
Just to take the substantive PRs in “the other” order this week…
</p>

<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-659">#659</a> 
</p>
</div>
</div>

<div id="outline-container-h-7AD4697B-8AB1-4407-9FF7-1FC483115FDC" class="outline-3">
<h3 id="h-7AD4697B-8AB1-4407-9FF7-1FC483115FDC"><span class="section-number-3">2.4.</span> PR #691: 688 Semantics of local union types, enumeration types, etc</h3>
<div class="outline-text-3" id="text-h-7AD4697B-8AB1-4407-9FF7-1FC483115FDC">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-691">#691</a>
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>